#+TITLE:Day 6 : Lanternfish
#+AUTHOR: Francesc Rocher

*** Compilation unit and evaluation
The compilation unit for this program is obtained with the composition of the
source code blocks shown here (evaluation of the program appears below):

#+name: day06_p2
#+header: :noweb yes :tangle src/day06_p1.adb :export both
#+header: :literal __Path__
#+header: :var __Path__=(file-name-directory (buffer-file-name (current-buffer)))
#+begin_src ada :unit day06_p1
  with Ada.Text_IO;                        use Ada.Text_IO;
  with Ada.Containers.Doubly_Linked_Lists; use Ada.Containers;

  procedure Day06_P1 is
     <<__Types__>>
     <<__Packages__>>
     <<__Variables__>>
  begin
     Open (Input, In_File, "__Path__" & "input");
        <<__Read_Timers__>>
     Close (Input);
     <<__Simulate_80_Days__>>
     <<__Result__>>
  end Day06_P1;
#+end_src

#+RESULTS: day06_p2
: Answer: 360761

